src/Openfoam/AeroSUV_mergedGeom_case_medium/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2312                                  |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.69;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2.69;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            kqRWallFunction;
        value           uniform 2.69;
    }

    top
    {
        type            symmetryPlane;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }

    Geometry
    {
        type            kqRWallFunction;
        value           uniform 2.69;
    }

}
